{
  "state": "DC",
  "state_name": "District of Columbia",
  "data_compiled": "2026-02-08",
  "general_requirements": {
    "permit_required": true,
    "permit_type": "both",
    "typical_fee_range": "$200-$600",
    "typical_timeline_days": "10-30",
    "inspection_required": true,
    "inspection_stages": ["final"],
    "statewide_permit_program": true,
    "statewide_program_name": "DC Department of Consumer and Regulatory Affairs (DCRA) manages all permits. Streamlined solar permitting process available for residential systems under 10 kW."
  },
  "interconnection": {
    "utility_approval_required": true,
    "net_metering_available": true,
    "net_metering_details": "DC has net metering through Pepco. Credits at full retail rate. Monthly rollover. Solar Renewable Energy Credits (SRECs) provide significant additional revenue at $300-400/MWh. DC has one of the highest SREC values in the nation.",
    "typical_timeline_days": "15-30",
    "fees": "Pepco standard interconnection fee applies"
  },
  "special_considerations": {
    "hoa_restrictions": "DC has strong solar access protections. Condo associations and HOAs cannot unreasonably restrict solar installations.",
    "historic_districts": "DC has extensive historic districts. Old Georgetown, Capitol Hill, Anacostia Historic District, and many others. DC Historic Preservation Office (HPO) review required. Solar installations visible from public streets in historic districts require review. Guidelines allow solar but with placement restrictions.",
    "wind_load_requirements": "Standard IBC requirements. Design wind speed approximately 115 mph.",
    "snow_load_requirements": "Moderate snow loads (25 psf ground snow load). Standard structural requirements."
  },
  "licensing": {
    "contractor_license_required": true,
    "license_type": "DC Basic Business License required. Electrical contractor license for solar PV installations. Home improvement contractor endorsement.",
    "nabcep_required": false
  },
  "notes": "DC has one of the most aggressive renewable energy standards in the nation (100% by 2032). High SREC values ($300-400/MWh) make solar extremely attractive financially. Solar for All program provides free solar to low-income residents. Row house architecture creates unique installation considerations. Pepco is the sole electric utility. The combination of high electricity rates, high SRECs, net metering, and federal employment creates an excellent residential solar market. Many government and institutional buildings already have solar."
}
