{
  "state": "NJ",
  "state_name": "New Jersey",
  "data_compiled": "2026-02-08",
  "general_requirements": {
    "permit_required": true,
    "permit_type": "both",
    "typical_fee_range": "$200-$800",
    "typical_timeline_days": "10-30",
    "inspection_required": true,
    "inspection_stages": ["rough-in", "final"],
    "statewide_permit_program": true,
    "statewide_program_name": "New Jersey passed automated solar permitting legislation in 2025 (unanimously). Developing state automated permitting platform. UCC (Uniform Construction Code) applies statewide."
  },
  "interconnection": {
    "utility_approval_required": true,
    "net_metering_available": true,
    "net_metering_details": "New Jersey has net metering for systems up to 2 MW. Credits at retail rate. Cap at 2.9% of total annual kWh sold by each utility. PSE&G, JCP&L, and Atlantic City Electric are major utilities. Monthly rollover, annual true-up at wholesale. Successor Solar Incentive (SuSI) program replaced SRECs with TRECs and ADIs.",
    "typical_timeline_days": "15-45",
    "fees": "Varies by utility; typically $100-$200 for residential interconnection"
  },
  "special_considerations": {
    "hoa_restrictions": "Strong solar access law (NJSA 45:22A-48.2). HOAs cannot prohibit solar installations. May impose only reasonable restrictions that do not significantly increase cost or reduce efficiency.",
    "historic_districts": "Numerous historic districts throughout the state. NJ Historic Preservation Office reviews solar in National Register districts. Some communities have detailed solar-in-historic-district guidelines.",
    "wind_load_requirements": "Coastal areas (Jersey Shore) have enhanced wind requirements. Design wind speeds 110-140 mph in coastal zones. Inland standard IBC.",
    "snow_load_requirements": "Moderate snow loads (15-35 psf ground snow load). Northwestern New Jersey has higher requirements."
  },
  "licensing": {
    "contractor_license_required": true,
    "license_type": "Home Improvement Contractor (HIC) registration required. Licensed electrician for electrical work. No specific solar contractor license but solar-specific knowledge expected.",
    "nabcep_required": false
  },
  "notes": "New Jersey is one of the strongest solar markets in the nation despite limited sunlight compared to southern/western states. Excellent incentives through SuSI program (TRECs for smaller systems, ADI for larger). Strong net metering. The state passed automated permitting legislation in 2025. Property tax exemption for solar. Sales tax exemption. High electricity rates support strong economics. 50% RPS by 2030. Community solar program active. One of the most mature residential solar markets in the US."
}
